# Pandas Tutorial

Pandas is a Python library providing high-performance, easy-to-use data structures and data analysis tools

Pandas deals with the following three data structures:

    Series
    DataFrame
    Panel (ignore this one for now)

### Importing the modules

In [3]:
import pandas as pd
import numpy as np

## Descriptive statistics

In [2]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

## Sum(axis)

In [3]:
print (df.sum(axis=0)) #sum of values in each column ,type doesn't matter

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [5]:
print (df.sum(axis=1)) #sum of only numerical values in each row

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [6]:
print (df[['Age']].sum(axis=0))

Age    382
dtype: int64

## mean()
returns the average value

In [1]:
#help(df.mean())

In [9]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [12]:
df.mean()  #of the numerical columns

Name      1.768330e-315
Age        3.183333e+01
Rating     3.743333e+00
dtype: float64

## std()
returns standard deviation only for the numerical columns

In [13]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

## Summarizing Data
describe() computes the summary of statistics

In [14]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [15]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

## Reindexing

In [18]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df_reindexed = df1.reindex(index=[0,2,5,10,8])

print(df1)
print('\n')
print(df_reindexed)

       col1      col2      col3
0 -0.229641  0.940860 -0.505193
1 -0.814653 -0.914341  0.248338
2 -0.134864  0.021799  0.605379
3  0.378038  0.908358 -0.244976
4 -0.739147 -0.898299 -1.376631


        col1      col2      col3
0  -0.229641  0.940860 -0.505193
2  -0.134864  0.021799  0.605379
5        NaN       NaN       NaN
10       NaN       NaN       NaN
8        NaN       NaN       NaN

In [22]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])


print(df1)
print('\n')

print(df2)
print('\n')


df = df2.reindex_like(df1)
#df = df1.reindex_like(df2)
print(df)

       col1      col2      col3
0  0.563994 -1.808068 -0.243822
1 -2.131842 -0.312292 -0.038038
2  0.751847 -0.037772 -1.259245
3  0.733350  0.208537 -1.073327
4  1.006754 -1.537822 -1.728253
5  0.080012  0.005370  0.803977
6 -0.773207 -1.302047 -0.716577
7  1.367603 -1.067502 -1.124891
8  1.009908 -0.445952 -0.156417
9  1.073309  0.910066  0.770072


       col1      col2      col3
0  0.049572 -1.219775 -1.098685
1 -1.059166 -0.425364 -0.726228
2 -0.069454  0.826700 -0.019945
3 -0.764592 -0.783477  0.979803
4  0.383117  0.228055 -0.563471
5  0.168484  0.239352 -1.262060
6 -1.011140 -1.352886  0.108579


       col1      col2      col3
0  0.563994 -1.808068 -0.243822
1 -2.131842 -0.312292 -0.038038
2  0.751847 -0.037772 -1.259245
3  0.733350  0.208537 -1.073327
4  1.006754 -1.537822 -1.728253
5  0.080012  0.005370  0.803977
6 -0.773207 -1.302047 -0.716577

## Changing the indexing

In [25]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

print(df1)
print('\n')

df1.index = [0,2,5,10,8]
df1

       col1      col2      col3
0  0.294193  0.615113 -0.048779
1 -0.098001 -0.406767 -0.382758
2 -0.064737 -0.235828  0.115868
3 -0.424140  0.457229 -0.708361
4 -2.023073 -1.688030 -0.749174

        col1      col2      col3
0   0.294193  0.615113 -0.048779
2  -0.098001 -0.406767 -0.382758
5  -0.064737 -0.235828  0.115868
10 -0.424140  0.457229 -0.708361
8  -2.023073 -1.688030 -0.749174

## Renaming rows and columns

In [26]:
print(df1)
print (df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'}, index = {0 : 'apple', 1 : 'banana', 2 : 'durian'}))

        col1      col2      col3
0   0.294193  0.615113 -0.048779
2  -0.098001 -0.406767 -0.382758
5  -0.064737 -0.235828  0.115868
10 -0.424140  0.457229 -0.708361
8  -2.023073 -1.688030 -0.749174
              c1        c2      col3
apple   0.294193  0.615113 -0.048779
durian -0.098001 -0.406767 -0.382758
5      -0.064737 -0.235828  0.115868
10     -0.424140  0.457229 -0.708361
8      -2.023073 -1.688030 -0.749174

## Iterating a DataFrame

### Iterating over columns

In [27]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

print(df)
print('\n')

for x in df:
    print(x)

       col1      col2      col3
0 -0.397909 -0.457218  1.612410
1 -0.285196 -0.265537  0.151325
2  1.313273 -1.898511 -2.003303
3 -0.471747  1.049491 -0.345829
4  1.507159 -1.513768  0.485361


col1
col2
col3

In [29]:
print(df)
print('\n')

for x in df.iteritems():
    print (x)
    print(type(x[1]))
    print('\n')

       col1      col2      col3
0 -0.397909 -0.457218  1.612410
1 -0.285196 -0.265537  0.151325
2  1.313273 -1.898511 -2.003303
3 -0.471747  1.049491 -0.345829
4  1.507159 -1.513768  0.485361


('col1', 0   -0.397909
1   -0.285196
2    1.313273
3   -0.471747
4    1.507159
Name: col1, dtype: float64)
<class 'pandas.core.series.Series'>


('col2', 0   -0.457218
1   -0.265537
2   -1.898511
3    1.049491
4   -1.513768
Name: col2, dtype: float64)
<class 'pandas.core.series.Series'>


('col3', 0    1.612410
1    0.151325
2   -2.003303
3   -0.345829
4    0.485361
Name: col3, dtype: float64)
<class 'pandas.core.series.Series'>

In [30]:
print(df)
print('\n')
print(type(df.iteritems()))
for key,value in df.iteritems():
    print (key)
    print(value)
    print('\n')

       col1      col2      col3
0 -0.397909 -0.457218  1.612410
1 -0.285196 -0.265537  0.151325
2  1.313273 -1.898511 -2.003303
3 -0.471747  1.049491 -0.345829
4  1.507159 -1.513768  0.485361


<class 'generator'>
col1
0   -0.397909
1   -0.285196
2    1.313273
3   -0.471747
4    1.507159
Name: col1, dtype: float64


col2
0   -0.457218
1   -0.265537
2   -1.898511
3    1.049491
4   -1.513768
Name: col2, dtype: float64


col3
0    1.612410
1    0.151325
2   -2.003303
3   -0.345829
4    0.485361
Name: col3, dtype: float64

### Iterating over rows

In [32]:
print(df)
print('\n')

for x in df.iterrows():
    print (x)
    print(type(x[1]))
    print('\n')

       col1      col2      col3
0 -0.397909 -0.457218  1.612410
1 -0.285196 -0.265537  0.151325
2  1.313273 -1.898511 -2.003303
3 -0.471747  1.049491 -0.345829
4  1.507159 -1.513768  0.485361


(0, col1   -0.397909
col2   -0.457218
col3    1.612410
Name: 0, dtype: float64)
<class 'pandas.core.series.Series'>


(1, col1   -0.285196
col2   -0.265537
col3    0.151325
Name: 1, dtype: float64)
<class 'pandas.core.series.Series'>


(2, col1    1.313273
col2   -1.898511
col3   -2.003303
Name: 2, dtype: float64)
<class 'pandas.core.series.Series'>


(3, col1   -0.471747
col2    1.049491
col3   -0.345829
Name: 3, dtype: float64)
<class 'pandas.core.series.Series'>


(4, col1    1.507159
col2   -1.513768
col3    0.485361
Name: 4, dtype: float64)
<class 'pandas.core.series.Series'>

In [33]:
print(df)
print('\n')

for row_index,row in df.iterrows():
    print (row_index)
    print(row)
    print(type(row))
    print('\n')

       col1      col2      col3
0 -0.397909 -0.457218  1.612410
1 -0.285196 -0.265537  0.151325
2  1.313273 -1.898511 -2.003303
3 -0.471747  1.049491 -0.345829
4  1.507159 -1.513768  0.485361


0
col1   -0.397909
col2   -0.457218
col3    1.612410
Name: 0, dtype: float64
<class 'pandas.core.series.Series'>


1
col1   -0.285196
col2   -0.265537
col3    0.151325
Name: 1, dtype: float64
<class 'pandas.core.series.Series'>


2
col1    1.313273
col2   -1.898511
col3   -2.003303
Name: 2, dtype: float64
<class 'pandas.core.series.Series'>


3
col1   -0.471747
col2    1.049491
col3   -0.345829
Name: 3, dtype: float64
<class 'pandas.core.series.Series'>


4
col1    1.507159
col2   -1.513768
col3    0.485361
Name: 4, dtype: float64
<class 'pandas.core.series.Series'>

### Note:
Do not try to modify any object while iterating. Iterating is meant for reading and the iterator returns a copy of the original object (a view), thus the changes will not reflect on the original object.

## Sorting

### Sorting by Value

In [37]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1') #kind='mergesort'

print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [35]:
?unsorted_df.sort_values

### Sorting by index

In [38]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
sorted_df=unsorted_df.sort_index()

print(unsorted_df)
print('\n')
print(sorted_df)

       col2      col1
1 -0.660467  0.169406
4  0.126758  0.145398
6 -0.763147  0.575982
2  1.140890 -0.766143
3 -0.687425  0.430354
5 -2.013468  0.345557
9 -0.406087  0.431982
8  0.952545  0.693558
0 -1.212398  0.845112
7 -0.873773  0.820291


       col2      col1
0 -1.212398  0.845112
1 -0.660467  0.169406
2  1.140890 -0.766143
3 -0.687425  0.430354
4  0.126758  0.145398
5 -2.013468  0.345557
6 -0.763147  0.575982
7 -0.873773  0.820291
8  0.952545  0.693558
9 -0.406087  0.431982

## Indexing and selecting data

### .loc, .iloc(use integer indexing) and .ix(the mix of 2, deprecated)

In [42]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

#select all rows for specific columns
print(df)
print('\n')
print(df.loc[:,['A','B']])
print('\n')

          A         B         C         D
a -1.578012 -0.524540  0.589161  1.184585
b  1.210726  1.081499 -0.966919  0.025593
c  0.077654  0.863895 -0.911243 -0.846638
d  0.093242  0.220712 -0.167552 -0.749333
e -1.317282  0.752750  0.590413  2.128657
f -0.355563 -0.574925  1.367709 -0.336206
g -0.133078  1.500651  0.256833  1.159181
h  0.114498  0.073854  2.344731 -0.337559


          A         B
a -1.578012 -0.524540
b  1.210726  1.081499
c  0.077654  0.863895
d  0.093242  0.220712
e -1.317282  0.752750
f -0.355563 -0.574925
g -0.133078  1.500651
h  0.114498  0.073854

In [43]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


#select some rows for specific columns
print(df)
print('\n')
print(df.loc[['a','b'],['A','B']])
print('\n')

          A         B         C         D
a  0.222391  0.547775  0.294316  1.232458
b -1.089932 -0.824807 -0.959514 -0.744333
c  1.258801 -0.494643  0.831245  1.175701
d -0.088046  0.534325  0.014322 -0.770531
e -1.999875 -0.310044  0.098464 -0.886844
f -0.066182 -2.959632  0.904168 -1.149002
g -0.006387 -0.868584 -0.241029  1.930158
h -2.004215 -1.123218 -1.650891  0.890656


          A         B
a  0.222391  0.547775
b -1.089932 -0.824807

In [44]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.loc['a']>0)
print('\n')

          A         B         C         D
a  1.048367 -1.019386 -0.333909  0.324278
b  1.932468  2.239760 -1.822709  0.791761
c -1.551684  1.456750  0.784067 -0.847882
d  0.744955 -0.573468  0.013721 -1.675767
e  0.187735  0.499867  0.460917  0.189722
f -1.560443 -0.428499 -0.703671 -0.649093
g -1.607374 -0.498572 -0.545800 -1.139573
h  0.489433 -0.451410 -0.603520  1.489114


A     True
B    False
C    False
D     True
Name: a, dtype: bool

In [47]:
df.loc['a','B'] = 10000
df

          A             B         C         D
a  1.048367  10000.000000 -0.333909  0.324278
b  1.932468      2.239760 -1.822709  0.791761
c -1.551684      1.456750  0.784067 -0.847882
d  0.744955     -0.573468  0.013721 -1.675767
e  0.187735      0.499867  0.460917  0.189722
f -1.560443     -0.428499 -0.703671 -0.649093
g -1.607374     -0.498572 -0.545800 -1.139573
h  0.489433     -0.451410 -0.603520  1.489114

In [48]:
df['A'] = 10000
df

       A             B         C         D
a  10000  10000.000000 -0.333909  0.324278
b  10000      2.239760 -1.822709  0.791761
c  10000      1.456750  0.784067 -0.847882
d  10000     -0.573468  0.013721 -1.675767
e  10000      0.499867  0.460917  0.189722
f  10000     -0.428499 -0.703671 -0.649093
g  10000     -0.498572 -0.545800 -1.139573
h  10000     -0.451410 -0.603520  1.489114

In [50]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

print(df)
print('\n')
print(df.iloc[[0,1],[0,1]])
print('\n')

          A         B         C         D
a -0.703010  0.412944 -1.506223  0.760760
b -1.908745 -0.264296 -0.066242  0.130088
c  1.827284 -0.260925  0.627443  0.135827
d -0.122956  1.867596  0.882397 -1.262694
e -1.939980  1.198832 -0.301984 -0.607322
f  0.929754  2.881895  0.505776 -0.723666
g -0.104505 -1.073479 -0.107716  0.695150
h -0.084828 -0.267748 -1.695143  0.827271


          A         B
a -0.703010  0.412944
b -1.908745 -0.264296

In [51]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.iloc[0:3,[0,1]])
print('\n')

          A         B         C         D
a -2.173503 -0.654665 -0.034491 -0.107042
b -0.087179  0.378949 -0.829361  0.749498
c -0.415193  0.132943 -0.614767 -1.043444
d -0.571212 -0.369323 -0.437184 -0.936504
e  1.669687 -1.358884  0.571554 -0.154297
f  0.939567 -0.323017  0.116236 -0.582725
g -1.066211  0.130044  1.467882 -0.799909
h  0.009438 -0.161981  0.761149 -1.011793


          A         B
a -2.173503 -0.654665
b -0.087179  0.378949
c -0.415193  0.132943

In [52]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.ix[:,'A'])

          A         B         C         D
a -2.588231  1.568642 -0.103304  0.541166
b  2.304704 -0.541800  0.324917  0.543401
c -1.572764  1.795231 -0.576179 -0.060322
d  1.532324  0.231957  0.326942 -0.860712
e -0.202122  0.699351  0.348654  0.857369
f -0.594924  0.409980  0.632382 -0.045763
g  0.622336  0.777574 -0.764631 -1.521043
h -0.310630  0.246976  0.420943  0.967773


a   -2.588231
b    2.304704
c   -1.572764
d    1.532324
e   -0.202122
f   -0.594924
g    0.622336
h   -0.310630
Name: A, dtype: float64

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  import sys

## Missing values

In [53]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a -1.848872  0.273213  1.225772
b       NaN       NaN       NaN
c -0.679944  0.345982 -0.259375
d       NaN       NaN       NaN
e  0.501884 -1.521845  0.056990
f  1.801685  0.617462 -1.018008
g       NaN       NaN       NaN
h  0.741382  0.218067 -1.381895

In [54]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [55]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

### Replacing the missing data

In [62]:
df

        one       two     three
a -1.848872  0.273213  1.225772
b       NaN       NaN       NaN
c -0.679944  0.345982 -0.259375
d       NaN       NaN       NaN
e  0.501884 -1.521845  0.056990
f  1.801685  0.617462 -1.018008
g       NaN       NaN       NaN
h  0.741382  0.218067 -1.381895

In [63]:
df1 = df.fillna(method = 'bfill')
df1

        one       two     three
a -1.848872  0.273213  1.225772
b -0.679944  0.345982 -0.259375
c -0.679944  0.345982 -0.259375
d  0.501884 -1.521845  0.056990
e  0.501884 -1.521845  0.056990
f  1.801685  0.617462 -1.018008
g  0.741382  0.218067 -1.381895
h  0.741382  0.218067 -1.381895

In [59]:
?df.fillna

### See some other options that fillna() provides in the python documentation :)

### Dropping the missing data

In [64]:
df2 = df.dropna()
df2

        one       two     three
a -1.848872  0.273213  1.225772
c -0.679944  0.345982 -0.259375
e  0.501884 -1.521845  0.056990
f  1.801685  0.617462 -1.018008
h  0.741382  0.218067 -1.381895

## Replacing regular values

In [73]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})

print(df)
print('\n')
df1 = df.replace({1000:10,2000:60})
df1

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

## Groupby

In [98]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
                     'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print(df)
print('\n')
print (df.groupby('Team'))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690


<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x1144bb668>

In [76]:
x = df.groupby('Team')
print (x.mean())

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [82]:
print (df.groupby('Team').median())
print (df.groupby('Team')[['Rank', 'Points']].median())

        Rank  Points
Team
Devils   2.5   768.0
Kings    1.0   756.0
Riders   2.0   741.5
Royals   2.5   752.5
kings    4.0   812.0

### View the groups

In [83]:
print (df.groupby('Team').groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

In [87]:
grouped = df.groupby('Year')

for name,group in grouped:
    print (name)
    print (group)
    print('\n')

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701


2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804


2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694


2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

## Aggregations
An aggregated function returns a single aggregated value for each group.

In [99]:
grouped = df.groupby('Year')
print (grouped['Points'].agg(np.mean))
print (grouped['Points'].mean())

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64
Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [101]:
grouped = df.groupby('Team')
x = grouped['Points'].agg([np.sum, np.mean, np.std])
x.index

Index(['Devils', 'Kings', 'Riders', 'Royals', 'kings'], dtype='object', name='Team')

In [90]:
df['Points'].agg([np.sum, np.mean, np.std])

sum     9187.000000
mean     765.583333
std       67.849376
Name: Points, dtype: float64

## Merging/Joining

In [102]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

### Merge Two DataFrames on a Key

In [104]:
pd.merge(df1,df2,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [106]:
# looks for equal touples
print(df1)
print(df2)

pd.merge(df1,df2,on=['id','subject_id'])

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [108]:
?pd.merge

### Left join

In [109]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [74]:
pd.merge(df1,df2, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

### Right join

In [110]:
pd.merge(df1,df2, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

### Outer join

In [111]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [112]:
#take all values of subject_id
pd.merge(df1,df2, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

### Inner join

In [115]:
#take common values of subject_id
pd.merge(df1, df2, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [79]:
?pd.merge

In [116]:
pd.merge(df2, df1, on='subject_id', how='inner')

   id_x Name_x subject_id  id_y  Name_y
0     1  Billy       sub2     2     Amy
1     2  Brian       sub4     3   Allen
2     4  Bryce       sub6     4   Alice
3     5  Betty       sub5     5  Ayoung

### Loading data from a file into a dataframe

In [4]:
s = pd.read_csv('Practical/data/gender.txt')
s

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [83]:
?pd.read_csv

In [127]:
import pandas as pd
s = pd.read_csv('Practical/data/gender.txt', sep='|', index_col = 'user_id')
s

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044
27        40      F      librarian    30030
28        32      M         writer    55369
29        41      M     programmer    94043
30         7      M        student    55436
...      ...    ...            ...      ...
914       44      F          other    08105
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
917       22      F        student    20006
918       40      M      scientist    70116
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [130]:
s.columns.tolist()

['age', 'gender', 'occupation', 'zip_code']